Tekla.Structures.Catalogs.ShapeUpAxis
Up axis direction

Tekla.Structures.Catalogs.ShapeUpAxis.Undefined
Undefined direction for axis. Should not be used in input.

Tekla.Structures.Catalogs.ShapeUpAxis.X_Axis
X points up.

Tekla.Structures.Catalogs.ShapeUpAxis.Y_Axis
Y points up.

Tekla.Structures.Catalogs.ShapeUpAxis.Z_Axis
Z points up.